000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. APOCALYPSE.
000300 PROCEDURE DIVISION.
000400    DISPLAY 'COBOL is Resurected!'.
000500    STOP RUN.
